Papiea-design.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2018-10-17 Wed 16:59 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Papiea Design</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Shlomi Vaknin" />
<link rel="stylesheet" type="text/css" href="https://www.pirilampo.org/styles/readtheorg/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="https://www.pirilampo.org/styles/readtheorg/css/readtheorg.css"/>
</head>
<body>
<div id="content">
<h1 class="title">Papiea Design</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org1c74556">1. Definitions</a></li>
<li><a href="#orgcdddd65">2. Data Structures</a>
<ul>
<li><a href="#orga3cd538">2.1. Spec</a></li>
<li><a href="#orgb252b7f">2.2. Status</a></li>
<li><a href="#org9719bf7">2.3. Metadata</a></li>
<li><a href="#org1eed5e2">2.4. Kind</a></li>
<li><a href="#org8c9771d">2.5. Provider description</a></li>
</ul>
</li>
<li><a href="#org3a2aa7f">3. Modules</a>
<ul>
<li><a href="#org153e67e">3.1. Databases</a>
<ul>
<li><a href="#org35e6a30">3.1.1. Status</a>
<ul>
<li><a href="#org28d0ecc">3.1.1.1. Interface</a></li>
</ul>
</li>
<li><a href="#org744ee2a">3.1.2. Spec</a>
<ul>
<li><a href="#org6bb0179">3.1.2.1. Interface</a></li>
</ul>
</li>
<li><a href="#org4b5f50c">3.1.3. Providers</a>
<ul>
<li><a href="#orgcae9bf6">3.1.3.1. Interface</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orgd3313ef">3.2. Dependent services</a>
<ul>
<li><a href="#org423b0e7">3.2.1. Tasks</a>
<ul>
<li><a href="#orgbb30b50">3.2.1.1. Interface</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org0507f90">3.3. Papiea Engine</a>
<ul>
<li><a href="#org156320d">3.3.1. Initialize</a>
<ul>
<li><a href="#org534d669">3.3.1.1. Interface</a></li>
<li><a href="#orgd881ec6">3.3.1.2. Pseudocode</a></li>
</ul>
</li>
<li><a href="#org5cffc6d">3.3.2. Exporting APIs</a>
<ul>
<li><a href="#org4da26d1">3.3.2.1. Admin facing APIs</a>
<ul>
<li><a href="#org55816a5">3.3.2.1.1. Pseudocode</a></li>
</ul>
</li>
<li><a href="#org9ef395f">3.3.2.2. Providers facing APIs</a></li>
<li><a href="#org7b02e40">3.3.2.3. User facing APIs</a></li>
</ul>
</li>
<li><a href="#orgeeeb724">3.3.3. Change Spec</a></li>
<li><a href="#orge770d43">3.3.4. Update Status</a></li>
<li><a href="#org0e59d1e">3.3.5. SFS - Status Fields Signature</a>
<ul>
<li><a href="#org5845971">3.3.5.1. Formal syntax of SFS</a></li>
<li><a href="#org64ec1b2">3.3.5.2. SFS struct</a></li>
</ul>
</li>
<li><a href="#org569244c">3.3.6. Procedures Signatures</a>
<ul>
<li><a href="#org9b5bc31">3.3.6.1. Procedure Signature struct</a></li>
</ul>
</li>
<li><a href="#org4225fad">3.3.7. Understanding Deltas</a>
<ul>
<li><a href="#orgc25300d">3.3.7.1. Matching SFSs to Deltas</a></li>
<li><a href="#org4e6bfa0">3.3.7.2. Determining Order</a></li>
</ul>
</li>
<li><a href="#org850945c">3.3.8. Provider</a></li>
<li><a href="#org32b306d">3.3.9. RBAC</a></li>
<li><a href="#org98700af">3.3.10. Scalability and Reliability</a>
<ul>
<li><a href="#org831b397">3.3.10.1. Leader election</a></li>
<li><a href="#org573c93f">3.3.10.2. Fault tolerance</a>
<ul>
<li><a href="#orgc86e9dd">3.3.10.2.1. Dead Papiea Instance</a></li>
<li><a href="#org3d415fe">3.3.10.2.2. Dead Provider</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orgb6849b0">3.3.11. Auditing</a></li>
</ul>
</li>
<li><a href="#org84afd74">3.4. Tasks</a>
<ul>
<li><a href="#orge0a6f02">3.4.1. Tracking change</a></li>
<li><a href="#org9846265">3.4.2. Finished</a></li>
</ul>
</li>
<li><a href="#orgea0fe58">3.5. Provider Library</a>
<ul>
<li><a href="#org422083a">3.5.1. Define Entity Model</a>
<ul>
<li><a href="#org46e338c">3.5.1.1. YAML</a></li>
<li><a href="#org56997a4">3.5.1.2. CRUD</a></li>
</ul>
</li>
<li><a href="#org2a9af3d">3.5.2. Initialize</a></li>
<li><a href="#orgd803330">3.5.3. Callback Mechanism</a></li>
<li><a href="#org84e8783">3.5.4. Running Effect Validator</a></li>
<li><a href="#org34402a5">3.5.5. Status Changes Handlers</a>
<ul>
<li><a href="#org5eb6a00">3.5.5.1. Registring</a></li>
<li><a href="#org08c0f91">3.5.5.2. Running using context</a></li>
</ul>
</li>
<li><a href="#org98e6176">3.5.6. Procedures</a>
<ul>
<li><a href="#org28789a4">3.5.6.1. Registring</a></li>
<li><a href="#orgff0c51d">3.5.6.2. Running using context</a></li>
</ul>
</li>
<li><a href="#orgff6e8ed">3.5.7. Example Provider</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orgb8b91ea">4. Full files</a>
<ul>
<li><a href="#org9d5406b">4.1. /src/papiea/engine/core.go</a></li>
<li><a href="#org6ea7748">4.2. /src/papiea/engine/server.go</a></li>
<li><a href="#orgb897bbb">4.3. /src/papiea/engine/provider.go</a></li>
</ul>
</li>
<li><a href="#orgbe1eb6a">5. Last notes</a></li>
</ul>
</div>
</div>
<p>
Papiea is aimed to be a reference implementation to a formal general purpose intent engine. 
</p>

<div id="outline-container-org1c74556" class="outline-2">
<h2 id="org1c74556"><span class="section-number-2">1</span> Definitions</h2>
<div class="outline-text-2" id="text-1">
<ul class="org-ul">
<li><span class="underline">Spec</span> - a map containing the desired state of a particular entity</li>
<li><span class="underline">Status</span> - a map containing the current statue of a particular entity. Always a superset of Spec</li>
<li><span class="underline">Metadata</span> - Information of the identity of the entity. Must contain at least <code>uuid</code>, <code>kind</code> and <code>spec_version</code></li>
<li><span class="underline">Spec version</span> - an integer representing the version of the current spec. Updates to spec will <code>CAS</code> on this field</li>
<li><span class="underline">Entity</span> - The tuple <code>[Metadata, Spec, Status]</code></li>
<li><span class="underline">Kind</span> - The "type" of the entity</li>
<li><span class="underline">Diff</span> - A difference between the current Status and the most recent desired Spec</li>
<li><span class="underline">Providers</span> - Pluggable handlers that can transform an entity from its current state to its desired state</li>
<li><span class="underline">Tasks</span> - a mechanism for following the progress of resolving Diffs</li>
</ul>
</div>
</div>
<div id="outline-container-orgcdddd65" class="outline-2">
<h2 id="orgcdddd65"><span class="section-number-2">2</span> Data Structures</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-orga3cd538" class="outline-3">
<h3 id="orga3cd538"><span class="section-number-3">2.1</span> Spec</h3>
<div class="outline-text-3" id="text-2-1">
<p>
Status and Spec are both unstructured, and may change at runtime (by changing providers). Go is a little afraid of
unstructured types, so we have to be very gentle. Here is an example of how this could be achieved.
</p>

<p>
First, lets declare an untyped json type:
</p>

<div class="org-src-container">
<pre class="src src-go" id="orgab1f03f"><span style="color: #F0DFAF; font-weight: bold;">type</span> <span style="color: #7CB8BB;">untyped_json</span> <span style="color: #F0DFAF; font-weight: bold;">map</span><span style="color: #DCDCCC;">[</span><span style="color: #7CB8BB;">string</span><span style="color: #DCDCCC;">]</span><span style="color: #F0DFAF; font-weight: bold;">interface</span><span style="color: #DCDCCC;">{}</span>
</pre>
</div>

<p>
Now, spec is simply an entyped<sub>json</sub>
</p>
<div class="org-src-container">
<pre class="src src-go" id="orgd17a05d"><span style="color: #F0DFAF; font-weight: bold;">type</span> <span style="color: #7CB8BB;">spec</span> <span style="color: #7CB8BB;">untyped_json</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-orgb252b7f" class="outline-3">
<h3 id="orgb252b7f"><span class="section-number-3">2.2</span> Status</h3>
<div class="outline-text-3" id="text-2-2">
<p>
For now its strictly untyped, but there may be a better way to denote the fact that status is a super-set of spec
</p>

<div class="org-src-container">
<pre class="src src-go" id="org0dbd9d2"><span style="color: #F0DFAF; font-weight: bold;">type</span> <span style="color: #7CB8BB;">status</span> <span style="color: #7CB8BB;">untyped_json</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org9719bf7" class="outline-3">
<h3 id="org9719bf7"><span class="section-number-3">2.3</span> Metadata</h3>
<div class="outline-text-3" id="text-2-3">
<p>
Metadata has a bit more structured then spec and status, it must have at least the following items:
</p>
<ul class="org-ul">
<li><code>uuid</code> - a unique id representing the identity of this entity</li>
<li><code>kind</code> - the "type" of this entity</li>
<li><code>spec_version</code> - the most up-to-date revision of the spec associated with this entity</li>
</ul>
<div class="org-src-container">
<pre class="src src-go" id="orgf89c07d"><span style="color: #F0DFAF; font-weight: bold;">type</span> <span style="color: #7CB8BB;">metadata</span> <span style="color: #F0DFAF; font-weight: bold;">struct</span> <span style="color: #DCDCCC;">{</span>
    <span style="color: #c0afa7;">uuid</span> <span style="color: #c0afa7;">uuid</span>
    <span style="color: #a7c0b9;">kind</span> <span style="color: #c0afa7;">string</span>
    <span style="color: #c0a7bd;">spec_version</span> <span style="color: #bba699;">int</span>
<span style="color: #DCDCCC;">}</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org1eed5e2" class="outline-3">
<h3 id="org1eed5e2"><span class="section-number-3">2.4</span> Kind</h3>
<div class="outline-text-3" id="text-2-4">
<p>
A Kind of an entity is the entity's type. It denotes the valid fields for spec and status for an instance of this kind.
</p>

<div class="org-src-container">
<pre class="src src-go" id="org28425e5"><span style="color: #F0DFAF; font-weight: bold;">type</span> <span style="color: #7CB8BB;">kind</span> <span style="color: #F0DFAF; font-weight: bold;">struct</span> <span style="color: #DCDCCC;">{</span>
    <span style="color: #bba699;">name</span> <span style="color: #c0afa7;">string</span>
    <span style="color: #b6a0e0;">entity_structure</span> <span style="color: #9999bb;">untyped_json</span>
<span style="color: #DCDCCC;">}</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org8c9771d" class="outline-3">
<h3 id="org8c9771d"><span class="section-number-3">2.5</span> Provider description</h3>
<div class="outline-text-3" id="text-2-5">
<p>
A Provider is a plugglable set of handlers, which is responsible for converging a certain entity kind. Its handlers
are responsible to move the entity from a current status to an intended spec.
</p>
<div class="org-src-container">
<pre class="src src-go" id="org735cc0b"><span style="color: #F0DFAF; font-weight: bold;">type</span> <span style="color: #7CB8BB;">provider_description</span> <span style="color: #F0DFAF; font-weight: bold;">struct</span> <span style="color: #DCDCCC;">{</span>
    <span style="color: #c0afa7;">uuid</span> <span style="color: #c0afa7;">uuid</span>
    <span style="color: #e0d0a0;">version</span> <span style="color: #bba699;">int</span>
    <span style="color: #99bbb4;">uri</span> <span style="color: #c0afa7;">string</span>
    <span style="color: #b6a0e0;">kinds</span> <span style="color: #BFEBBF;">[]</span><span style="color: #7CB8BB;">kind</span>
<span style="color: #DCDCCC;">}</span>
</pre>
</div>

<p>
It has a unique identifier and a version, as well as a uri that is a logical name that will be used to access an
instance of the provider (since there may be multiple instances with a load-balancer). For example, a uri could be:
<code>https://nunet.nutanix.com/hosts</code>. A provider may support multiple kinds but we believe it is best practice to have
one provider per kind.
</p>
</div>
</div>
</div>
