Papiea-design.org
** Databases
   #+BEGIN_note
   *Multitenancy*: All databases are aware of tenants. It may be implemented as a column or attribute of a table or
   document, or as a different database with a different connect uri.
   #+END_note
   
*** Status
    Status database will be a mapping from a metadata (namely, =uuid= and =kind=) to a status json document. 

    It may be implemented using a very fast in-memory database, since it may require frequent access depending on an
    entity's kind requirement. It is not required to have this database persisted to disk, since its content can always
    be reaquired by the providers, by asking all the providers to list all the real statuses of all objects known to
    them.

    Each provider for a kind will supply its entity's structure in its YAML.
    
**** Interface
    #+Name: status-db-interface
    #+BEGIN_SRC go
      type status_db interface {
          update_status(metadata, status) err
          get_status(metadata) status, err
          delete_status(metadata) err
          cleanup() err
      }
    #+END_SRC

*** Spec
    Unlike status which can always be fetched from the providers, spec is a record of the user's intent and must be
    persisted to disk. It must also be scalable and highly available. It must have a clear notion of CAS
    (compare-and-set/swap) in order to atomically update spec values.

**** Interface
    #+Name: spec-db-interface
    #+BEGIN_SRC go
      type spec_db interface {
          cas_spec_change(metadata, status) task, err
          get_latest_spec(metadata) metadata, spec, err
          cleanup() err
      }
    #+END_SRC

*** Providers
    Providers database stores all the configurations a provider may need, which is encoded in [[*Provider description][Provider description]] section.

**** Interface
    #+Name: providers-db-interface
    #+BEGIN_SRC go
      type providers_db interface {
          add_provider(provider_description) err
          upgrade_provider(from provider_description, to provider_description) err
          list_providers() []provider_description
          delete_provider(provider_uuid) err
      }
    #+END_SRC

** Dependent services
*** Tasks
    Tasks in Papiea's sense is not a process tracking mechanism. In a normal system, a process is started and it is
    assigned to a task which reflects the status of the running process, whether it succeeds or fails, return values or
    error messages etc.

    Papiea does not start a particular thread or process to converge a =Diff=. It may be converge by user interaction
    (such as changing the real underlying resource) or by invoking a provider's function. Such a function may succeed or
    fail and re-run again which may later succeed.

    A task is thus defined as a mechanism to track the progress of change towards a *particular* spec version. To get a
    clear understanding of the logic underlying this please see [[*Tasks][Tasks]] section below.

**** Interface
     #+Name: task-interface
     #+BEGIN_SRC go
       type task interface {
           new_task(metadata) task
       }
     #+END_SRC
    
** Papiea Engine
*** Initialize
    When Papiea loads up, it needs to initialize its database connections, load the providers, generate entity
    validators and expose CRUD and [[*Procedures][Procedural]] APIs.
   
**** Interface    
    #+Name: initialize-papiea
    #+BEGIN_SRC go
      type papiea struct {
          api rest.api
          status_db
          spec_db
          providers_db
      }

      type papiea-init interface {
          initialize() papiea, err
      }
    #+END_SRC

