Papiea-design.html

<div id="outline-container-org3a2aa7f" class="outline-2">
<h2 id="org3a2aa7f"><span class="section-number-2">3</span> Modules</h2>
<div class="outline-text-2" id="text-3">
</div>
<div id="outline-container-org153e67e" class="outline-3">
<h3 id="org153e67e"><span class="section-number-3">3.1</span> Databases</h3>
<div class="outline-text-3" id="text-3-1">
<div class="note">
<p>
<b>Multitenancy</b>: All databases are aware of tenants. It may be implemented as a column or attribute of a table or
document, or as a different database with a different connect uri.
</p>

</div>
</div>

<div id="outline-container-org35e6a30" class="outline-4">
<h4 id="org35e6a30"><span class="section-number-4">3.1.1</span> Status</h4>
<div class="outline-text-4" id="text-3-1-1">
<p>
Status database will be a mapping from a metadata (namely, <code>uuid</code> and <code>kind</code>) to a status json document. 
</p>

<p>
It may be implemented using a very fast in-memory database, since it may require frequent access depending on an
entity's kind requirement. It is not required to have this database persisted to disk, since its content can always
be reaquired by the providers, by asking all the providers to list all the real statuses of all objects known to
them.
</p>

<p>
Each provider for a kind will supply its entity's structure in its YAML.
</p>
</div>

<div id="outline-container-org28d0ecc" class="outline-5">
<h5 id="org28d0ecc"><span class="section-number-5">3.1.1.1</span> Interface</h5>
<div class="outline-text-5" id="text-3-1-1-1">
<div class="org-src-container">
<pre class="src src-go" id="org700a63f"><span style="color: #F0DFAF; font-weight: bold;">type</span> <span style="color: #7CB8BB;">status_db</span> <span style="color: #F0DFAF; font-weight: bold;">interface</span> <span style="color: #DCDCCC;">{</span>
    <span style="color: #93E0E3;">update_status</span><span style="color: #BFEBBF;">(</span><span style="color: #99bbb4;">metadata</span>, <span style="color: #bba699;">status</span><span style="color: #BFEBBF;">)</span> <span style="color: #e0a0bc;">err</span>
    <span style="color: #93E0E3;">get_status</span><span style="color: #BFEBBF;">(</span><span style="color: #99bbb4;">metadata</span><span style="color: #BFEBBF;">)</span> <span style="color: #bba699;">status</span>, <span style="color: #e0a0bc;">err</span>
    <span style="color: #93E0E3;">delete_status</span><span style="color: #BFEBBF;">(</span><span style="color: #99bbb4;">metadata</span><span style="color: #BFEBBF;">)</span> <span style="color: #e0a0bc;">err</span>
    <span style="color: #93E0E3;">cleanup</span><span style="color: #BFEBBF;">()</span> <span style="color: #e0a0bc;">err</span>
<span style="color: #DCDCCC;">}</span>
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org744ee2a" class="outline-4">
<h4 id="org744ee2a"><span class="section-number-4">3.1.2</span> Spec</h4>
<div class="outline-text-4" id="text-3-1-2">
<p>
Unlike status which can always be fetched from the providers, spec is a record of the user's intent and must be
persisted to disk. It must also be scalable and highly available. It must have a clear notion of CAS
(compare-and-set/swap) in order to atomically update spec values.
</p>
</div>

<div id="outline-container-org6bb0179" class="outline-5">
<h5 id="org6bb0179"><span class="section-number-5">3.1.2.1</span> Interface</h5>
<div class="outline-text-5" id="text-3-1-2-1">
<div class="org-src-container">
<pre class="src src-go" id="org803662f"><span style="color: #F0DFAF; font-weight: bold;">type</span> <span style="color: #7CB8BB;">spec_db</span> <span style="color: #F0DFAF; font-weight: bold;">interface</span> <span style="color: #DCDCCC;">{</span>
    <span style="color: #93E0E3;">cas_spec_change</span><span style="color: #BFEBBF;">(</span><span style="color: #99bbb4;">metadata</span>, <span style="color: #bba699;">status</span><span style="color: #BFEBBF;">)</span> <span style="color: #e0a0bc;">task</span>, <span style="color: #e0a0bc;">err</span>
    <span style="color: #93E0E3;">get_latest_spec</span><span style="color: #BFEBBF;">(</span><span style="color: #99bbb4;">metadata</span><span style="color: #BFEBBF;">)</span> <span style="color: #99bbb4;">metadata</span>, <span style="color: #e0a0bc;">spec</span>, <span style="color: #e0a0bc;">err</span>
    <span style="color: #93E0E3;">cleanup</span><span style="color: #BFEBBF;">()</span> <span style="color: #e0a0bc;">err</span>
<span style="color: #DCDCCC;">}</span>
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org4b5f50c" class="outline-4">
<h4 id="org4b5f50c"><span class="section-number-4">3.1.3</span> Providers</h4>
<div class="outline-text-4" id="text-3-1-3">
<p>
Providers database stores all the configurations a provider may need, which is encoded in <a href="#org8c9771d">Provider description</a> section.
</p>
</div>

<div id="outline-container-orgcae9bf6" class="outline-5">
<h5 id="orgcae9bf6"><span class="section-number-5">3.1.3.1</span> Interface</h5>
<div class="outline-text-5" id="text-3-1-3-1">
<div class="org-src-container">
<pre class="src src-go" id="org39ce75a"><span style="color: #F0DFAF; font-weight: bold;">type</span> <span style="color: #7CB8BB;">providers_db</span> <span style="color: #F0DFAF; font-weight: bold;">interface</span> <span style="color: #DCDCCC;">{</span>
    <span style="color: #93E0E3;">add_provider</span><span style="color: #BFEBBF;">(</span><span style="color: #a3e0a0;">provider_description</span><span style="color: #BFEBBF;">)</span> <span style="color: #e0a0bc;">err</span>
    <span style="color: #93E0E3;">upgrade_provider</span><span style="color: #BFEBBF;">(</span><span style="color: #a3e0a0;">from</span> <span style="color: #a3e0a0;">provider_description</span>, <span style="color: #e0a0bc;">to</span> <span style="color: #a3e0a0;">provider_description</span><span style="color: #BFEBBF;">)</span> <span style="color: #e0a0bc;">err</span>
    <span style="color: #93E0E3;">list_providers</span><span style="color: #BFEBBF;">()</span> <span style="color: #BFEBBF;">[]</span><span style="color: #7CB8BB;">provider_description</span>
    <span style="color: #93E0E3;">delete_provider</span><span style="color: #BFEBBF;">(</span><span style="color: #e0d0a0;">provider_uuid</span><span style="color: #BFEBBF;">)</span> <span style="color: #e0a0bc;">err</span>
<span style="color: #DCDCCC;">}</span>
</pre>
</div>
</div>
</div>
</div>
</div>

<div id="outline-container-orgd3313ef" class="outline-3">
<h3 id="orgd3313ef"><span class="section-number-3">3.2</span> Dependent services</h3>
<div class="outline-text-3" id="text-3-2">
</div>
<div id="outline-container-org423b0e7" class="outline-4">
<h4 id="org423b0e7"><span class="section-number-4">3.2.1</span> Tasks</h4>
<div class="outline-text-4" id="text-3-2-1">
<p>
Tasks in Papiea's sense is not a process tracking mechanism. In a normal system, a process is started and it is
assigned to a task which reflects the status of the running process, whether it succeeds or fails, return values or
error messages etc.
</p>

<p>
Papiea does not start a particular thread or process to converge a <code>Diff</code>. It may be converge by user interaction
(such as changing the real underlying resource) or by invoking a provider's function. Such a function may succeed or
fail and re-run again which may later succeed.
</p>

<p>
A task is thus defined as a mechanism to track the progress of change towards a <b>particular</b> spec version. To get a
clear understanding of the logic underlying this please see <a href="#org423b0e7">Tasks</a> section below.
</p>
</div>

<div id="outline-container-orgbb30b50" class="outline-5">
<h5 id="orgbb30b50"><span class="section-number-5">3.2.1.1</span> Interface</h5>
<div class="outline-text-5" id="text-3-2-1-1">
<div class="org-src-container">
<pre class="src src-go" id="org64fe031"><span style="color: #F0DFAF; font-weight: bold;">type</span> <span style="color: #7CB8BB;">task</span> <span style="color: #F0DFAF; font-weight: bold;">interface</span> <span style="color: #DCDCCC;">{</span>
    <span style="color: #93E0E3;">new_task</span><span style="color: #BFEBBF;">(</span><span style="color: #99bbb4;">metadata</span><span style="color: #BFEBBF;">)</span> <span style="color: #e0a0bc;">task</span>
<span style="color: #DCDCCC;">}</span>
</pre>
</div>
</div>
</div>
</div>
</div>

<div id="outline-container-org0507f90" class="outline-3">
<h3 id="org0507f90"><span class="section-number-3">3.3</span> Papiea Engine</h3>
<div class="outline-text-3" id="text-3-3">
</div>
<div id="outline-container-org156320d" class="outline-4">
<h4 id="org156320d"><span class="section-number-4">3.3.1</span> Initialize</h4>
<div class="outline-text-4" id="text-3-3-1">
<p>
When Papiea loads up, it needs to initialize its database connections, load the providers, generate entity
validators and expose CRUD and <a href="#org98e6176">Procedural</a> APIs.
</p>
</div>

<div id="outline-container-org534d669" class="outline-5">
<h5 id="org534d669"><span class="section-number-5">3.3.1.1</span> Interface</h5>
<div class="outline-text-5" id="text-3-3-1-1">
<div class="org-src-container">
<pre class="src src-go" id="org5d57d9c"><span style="color: #F0DFAF; font-weight: bold;">type</span> <span style="color: #7CB8BB;">papiea</span> <span style="color: #F0DFAF; font-weight: bold;">struct</span> <span style="color: #DCDCCC;">{</span>
    <span style="color: #a7aac0;">api</span> <span style="color: #99bbb4;">rest</span>.<span style="color: #a7aac0;">api</span>
    <span style="color: #99bbb4;">status_db</span>
    <span style="color: #e0a0bc;">spec_db</span>
    <span style="color: #b6a0e0;">providers_db</span>
<span style="color: #DCDCCC;">}</span>

<span style="color: #F0DFAF; font-weight: bold;">type</span> <span style="color: #7CB8BB;">papiea-init</span> <span style="color: #F0DFAF; font-weight: bold;">interface</span> <span style="color: #DCDCCC;">{</span>
    <span style="color: #93E0E3;">initialize</span><span style="color: #BFEBBF;">()</span> <span style="color: #a7c0b9;">papiea</span>, <span style="color: #e0a0bc;">err</span>
<span style="color: #DCDCCC;">}</span>
</pre>
</div>
</div>
</div>
