Papiea-design.org
**** Pseudocode
     #+Name: initialize-papiea-pc
     #+BEGIN_SRC go
       // Initialize papiea engine
       func (papiea papiea) initialize() papiea, err {
           // Load databases
           papiea.status_db // initialize db connection
           papiea.spec_db // initialize db connection
           papiea.providers_db // initialize db connection

           // Sets up the rest api engine
           papiea.api = new rest.api()

           // Start admin facing apis
           papiea.admin_facing_apis()

           // Start providers facing apis
           papiea.provider_facing_api()

           // Start user facing apis
           papiea.user_facing_api()
       }
     #+END_SRC
*** Exporting APIs
    Papiea provides three tiers of APIs: Admin, Provider and User facing.

    The struct that we need for the api will maintain an embedded =papiea= struct, and will add a
    =prefix=. Prefix is the http prefix for papiea api server, such as "/papiea/api/v1".

    #+Name: papiea-api-struct
    #+BEGIN_SRC go
      type papiea_api_ctx struct {
          *papiea
          prefix string
      }
    #+END_SRC
    
    Here is the interface for registring these apis:

    #+Name: exporting-apis
    #+BEGIN_SRC go
      type papiea_apis interface {
          admin_facing_apis() err
          providers_facing_api() err
          user_facing_api() err
      }
    #+END_SRC
    
    Next sections go into greater details into each of the apis.
**** Admin facing APIs
     The admin apis exposed by Papiea are used to manage providers: registrating, upgrading, deleting etc.
***** Pseudocode     
      #+Name: admin-api-pc
      #+BEGIN_SRC go
        func (papiea_apis papiea_api_ctx) admin_facing_apis() err {
            papiea_apis.api.post(papiea_apis.prefix+"/providers", func(req, res) {
                register_or_upgrade_provider(req.provider_description)
            })
        }
      #+END_SRC
     
