Papiea-design.html

<div id="outline-container-orgd881ec6" class="outline-5">
<h5 id="orgd881ec6"><span class="section-number-5">3.3.1.2</span> Pseudocode</h5>
<div class="outline-text-5" id="text-3-3-1-2">
<div class="org-src-container">
<pre class="src src-go" id="org4180493"><span style="color: #5F7F5F;">// </span><span style="color: #7F9F7F;">Initialize papiea engine</span>
<span style="color: #F0DFAF; font-weight: bold;">func</span> <span style="color: #DCDCCC;">(</span><span style="color: #a7c0b9;">papiea</span> <span style="color: #7CB8BB;">papiea</span><span style="color: #DCDCCC;">)</span> <span style="color: #93E0E3;">initialize</span><span style="color: #DCDCCC;">()</span> <span style="color: #7CB8BB;">papiea</span>, <span style="color: #e0a0bc;">err</span> <span style="color: #DCDCCC;">{</span>
    <span style="color: #5F7F5F;">// </span><span style="color: #7F9F7F;">Load databases</span>
    <span style="color: #a7c0b9;">papiea</span>.<span style="color: #99bbb4;">status_db</span> <span style="color: #5F7F5F;">// </span><span style="color: #7F9F7F;">initialize db connection</span>
    <span style="color: #a7c0b9;">papiea</span>.<span style="color: #e0a0bc;">spec_db</span> <span style="color: #5F7F5F;">// </span><span style="color: #7F9F7F;">initialize db connection</span>
    <span style="color: #a7c0b9;">papiea</span>.<span style="color: #b6a0e0;">providers_db</span> <span style="color: #5F7F5F;">// </span><span style="color: #7F9F7F;">initialize db connection</span>

    <span style="color: #5F7F5F;">// </span><span style="color: #7F9F7F;">Sets up the rest api engine</span>
    <span style="color: #a7c0b9;">papiea</span>.<span style="color: #a7aac0;">api</span> = <span style="color: #b6a0e0;">new</span> <span style="color: #99bbb4;">rest</span>.<span style="color: #93E0E3;">api</span><span style="color: #BFEBBF;">()</span>

    <span style="color: #5F7F5F;">// </span><span style="color: #7F9F7F;">Start admin facing apis</span>
    <span style="color: #a7c0b9;">papiea</span>.<span style="color: #93E0E3;">admin_facing_apis</span><span style="color: #BFEBBF;">()</span>

    <span style="color: #5F7F5F;">// </span><span style="color: #7F9F7F;">Start providers facing apis</span>
    <span style="color: #a7c0b9;">papiea</span>.<span style="color: #93E0E3;">provider_facing_api</span><span style="color: #BFEBBF;">()</span>

    <span style="color: #5F7F5F;">// </span><span style="color: #7F9F7F;">Start user facing apis</span>
    <span style="color: #a7c0b9;">papiea</span>.<span style="color: #93E0E3;">user_facing_api</span><span style="color: #BFEBBF;">()</span>
<span style="color: #DCDCCC;">}</span>
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-org5cffc6d" class="outline-4">
<h4 id="org5cffc6d"><span class="section-number-4">3.3.2</span> Exporting APIs</h4>
<div class="outline-text-4" id="text-3-3-2">
<p>
Papiea provides three tiers of APIs: Admin, Provider and User facing.
</p>

<p>
The struct that we need for the api will maintain an embedded <code>papiea</code> struct, and will add a
<code>prefix</code>. Prefix is the http prefix for papiea api server, such as "/papiea/api/v1".
</p>

<div class="org-src-container">
<pre class="src src-go" id="org1367986"><span style="color: #F0DFAF; font-weight: bold;">type</span> <span style="color: #7CB8BB;">papiea_api_ctx</span> <span style="color: #F0DFAF; font-weight: bold;">struct</span> <span style="color: #DCDCCC;">{</span>
    *<span style="color: #a7c0b9;">papiea</span>
    <span style="color: #a0d6e0;">prefix</span> <span style="color: #c0afa7;">string</span>
<span style="color: #DCDCCC;">}</span>
</pre>
</div>

<p>
Here is the interface for registring these apis:
</p>

<div class="org-src-container">
<pre class="src src-go" id="org189b11b"><span style="color: #F0DFAF; font-weight: bold;">type</span> <span style="color: #7CB8BB;">papiea_apis</span> <span style="color: #F0DFAF; font-weight: bold;">interface</span> <span style="color: #DCDCCC;">{</span>
    <span style="color: #93E0E3;">admin_facing_apis</span><span style="color: #BFEBBF;">()</span> <span style="color: #e0a0bc;">err</span>
    <span style="color: #93E0E3;">providers_facing_api</span><span style="color: #BFEBBF;">()</span> <span style="color: #e0a0bc;">err</span>
    <span style="color: #93E0E3;">user_facing_api</span><span style="color: #BFEBBF;">()</span> <span style="color: #e0a0bc;">err</span>
<span style="color: #DCDCCC;">}</span>
</pre>
</div>

<p>
Next sections go into greater details into each of the apis.
</p>
</div>
<div id="outline-container-org4da26d1" class="outline-5">
<h5 id="org4da26d1"><span class="section-number-5">3.3.2.1</span> Admin facing APIs</h5>
<div class="outline-text-5" id="text-3-3-2-1">
<p>
The admin apis exposed by Papiea are used to manage providers: registrating, upgrading, deleting etc.
</p>
</div>
<div id="outline-container-org55816a5" class="outline-6">
<h6 id="org55816a5"><span class="section-number-6">3.3.2.1.1</span> Pseudocode</h6>
<div class="outline-text-6" id="text-3-3-2-1-1">
<div class="org-src-container">
<pre class="src src-go" id="org2ffee26"><span style="color: #F0DFAF; font-weight: bold;">func</span> <span style="color: #DCDCCC;">(</span><span style="color: #a7c0b9;">papiea_apis</span> <span style="color: #7CB8BB;">papiea_api_ctx</span><span style="color: #DCDCCC;">)</span> <span style="color: #93E0E3;">admin_facing_apis</span><span style="color: #DCDCCC;">()</span> <span style="color: #7CB8BB;">err</span> <span style="color: #DCDCCC;">{</span>
    <span style="color: #a7c0b9;">papiea_apis</span>.<span style="color: #a7aac0;">api</span>.<span style="color: #93E0E3;">post</span><span style="color: #BFEBBF;">(</span><span style="color: #a7c0b9;">papiea_apis</span>.<span style="color: #a0d6e0;">prefix</span>+<span style="color: #CC9393;">"/providers"</span>, <span style="color: #F0DFAF; font-weight: bold;">func</span><span style="color: #D0BF8F;">(</span><span style="color: #7CB8BB;">req</span>, <span style="color: #7CB8BB;">res</span><span style="color: #D0BF8F;">)</span> <span style="color: #D0BF8F;">{</span>
        <span style="color: #93E0E3;">register_or_upgrade_provider</span><span style="color: #93E0E3;">(</span><span style="color: #a0d6e0;">req</span>.<span style="color: #a3e0a0;">provider_description</span><span style="color: #93E0E3;">)</span>
    <span style="color: #D0BF8F;">}</span><span style="color: #BFEBBF;">)</span>
<span style="color: #DCDCCC;">}</span>
</pre>
</div>
</div>
</div>
</div>
