Papiea-design.org
**** Providers facing APIs
     Provider facing defines the interactions between a provider and the
     intent-engine.  It lets the provider register [[*SFS - Status Fields Signature][Status Fields Signature]]
     handlers for intentful apis, and procedural apis which will be exposed to
     the user.

     Three apis are exposed:
     - =POST "/on"= - recieves an [[*SFS - Status Fields Signature][SF Signature]] and a callback url from the client. Registers the
       callback url to a component that listen on status changes and calls the callback url when a
       matching status change has taken place
     - =POST "/procedure"= - receives a [[*Procedures Signatures][Procedures Signatures]] and a callback url from the
       client. The signature is then used to expose a user facing api. When the user uses this api
       endpoint, the callback will get called
     - =POST "/status"= - sends a voluntary status update regarding an entity. Recieves a context
       which identifies the context in which this was called, the metadata of entity and its new
       status. This functionality is only exposed to the providers, since they are the only view
       Papiea has of the real world. 

     #+Name: provider-api-pc
     #+BEGIN_SRC go
       func (papiea_apis papiea_api_ctx) provider_facing_api() err {
           // Registering Provider Facing APIs
           api = papiea_apis.api
           papiea_prefix = papiea_apis.prefix
	
           api.post(papiea_prefix+"/on", func(req, res) {
               // callback url is being generated by the papiea provider library and passed on the request
               papiea_apis.register_intentful_callback(req.signature, req.callback_url)
           })

           api.post(papiea_prefix+"/procedure", func(req, res) {
               // callback url is being generated by the papiea provider library and passed on the request
               papiea_apis.register_procedural_callback(req.signature, req.callback_url)
           })

           // Status update is only exposed to providers. Users can't update status
           api.post(papiea+"/status", func(req, res) {
               res.status(update_status_in_db(req.uuid, req.status) ? 200 : 400)
               return res;
           })
       }


     #+END_SRC
**** User facing APIs
     
     #+Name: user-api-pc
     #+BEGIN_SRC go
       func (papiea papiea) user_facing_apis() err {
           registered_providers = papiea.providers_db.list_providers()

           for _, provider := range registered_providers {
               for _, kind := range provider.kinds{
			
               }
           }
       }
     #+END_SRC
*** Change Spec
*** Update Status
