Papiea-design.html

<div id="outline-container-org9ef395f" class="outline-5">
<h5 id="org9ef395f"><span class="section-number-5">3.3.2.2</span> Providers facing APIs</h5>
<div class="outline-text-5" id="text-3-3-2-2">
<p>
Provider facing defines the interactions between a provider and the
intent-engine.  It lets the provider register <a href="#org0e59d1e">Status Fields Signature</a>
handlers for intentful apis, and procedural apis which will be exposed to
the user.
</p>

<p>
Three apis are exposed:
</p>
<ul class="org-ul">
<li><code>POST "/on"</code> - recieves an <a href="#org0e59d1e">SF Signature</a> and a callback url from the client. Registers the
callback url to a component that listen on status changes and calls the callback url when a
matching status change has taken place</li>
<li><code>POST "/procedure"</code> - receives a <a href="#org569244c">Procedures Signatures</a> and a callback url from the
client. The signature is then used to expose a user facing api. When the user uses this api
endpoint, the callback will get called</li>
<li><code>POST "/status"</code> - sends a voluntary status update regarding an entity. Recieves a context
which identifies the context in which this was called, the metadata of entity and its new
status. This functionality is only exposed to the providers, since they are the only view
Papiea has of the real world.</li>
</ul>

<div class="org-src-container">
<pre class="src src-go" id="org4a9ba9a"><span style="color: #F0DFAF; font-weight: bold;">func</span> <span style="color: #DCDCCC;">(</span><span style="color: #a7c0b9;">papiea_apis</span> <span style="color: #7CB8BB;">papiea_api_ctx</span><span style="color: #DCDCCC;">)</span> <span style="color: #93E0E3;">provider_facing_api</span><span style="color: #DCDCCC;">()</span> <span style="color: #7CB8BB;">err</span> <span style="color: #DCDCCC;">{</span>
    <span style="color: #5F7F5F;">// </span><span style="color: #7F9F7F;">Registering Provider Facing APIs</span>
    <span style="color: #a7aac0;">api</span> = <span style="color: #a7c0b9;">papiea_apis</span>.<span style="color: #a7aac0;">api</span>
    <span style="color: #b3c0a7;">papiea_prefix</span> = <span style="color: #a7c0b9;">papiea_apis</span>.<span style="color: #a0d6e0;">prefix</span>

    <span style="color: #a7aac0;">api</span>.<span style="color: #93E0E3;">post</span><span style="color: #BFEBBF;">(</span><span style="color: #b3c0a7;">papiea_prefix</span>+<span style="color: #CC9393;">"/on"</span>, <span style="color: #F0DFAF; font-weight: bold;">func</span><span style="color: #D0BF8F;">(</span><span style="color: #7CB8BB;">req</span>, <span style="color: #7CB8BB;">res</span><span style="color: #D0BF8F;">)</span> <span style="color: #D0BF8F;">{</span>
        <span style="color: #5F7F5F;">// </span><span style="color: #7F9F7F;">callback url is being generated by the papiea provider library and passed on the request</span>
        <span style="color: #a7c0b9;">papiea_apis</span>.<span style="color: #93E0E3;">register_intentful_callback</span><span style="color: #93E0E3;">(</span><span style="color: #a0d6e0;">req</span>.<span style="color: #a6bb99;">signature</span>, <span style="color: #a0d6e0;">req</span>.<span style="color: #b3c0a7;">callback_url</span><span style="color: #93E0E3;">)</span>
    <span style="color: #D0BF8F;">}</span><span style="color: #BFEBBF;">)</span>

    <span style="color: #a7aac0;">api</span>.<span style="color: #93E0E3;">post</span><span style="color: #BFEBBF;">(</span><span style="color: #b3c0a7;">papiea_prefix</span>+<span style="color: #CC9393;">"/procedure"</span>, <span style="color: #F0DFAF; font-weight: bold;">func</span><span style="color: #D0BF8F;">(</span><span style="color: #7CB8BB;">req</span>, <span style="color: #7CB8BB;">res</span><span style="color: #D0BF8F;">)</span> <span style="color: #D0BF8F;">{</span>
        <span style="color: #5F7F5F;">// </span><span style="color: #7F9F7F;">callback url is being generated by the papiea provider library and passed on the request</span>
        <span style="color: #a7c0b9;">papiea_apis</span>.<span style="color: #93E0E3;">register_procedural_callback</span><span style="color: #93E0E3;">(</span><span style="color: #a0d6e0;">req</span>.<span style="color: #a6bb99;">signature</span>, <span style="color: #a0d6e0;">req</span>.<span style="color: #b3c0a7;">callback_url</span><span style="color: #93E0E3;">)</span>
    <span style="color: #D0BF8F;">}</span><span style="color: #BFEBBF;">)</span>

    <span style="color: #5F7F5F;">// </span><span style="color: #7F9F7F;">Status update is only exposed to providers. Users can't update status</span>
    <span style="color: #a7aac0;">api</span>.<span style="color: #93E0E3;">post</span><span style="color: #BFEBBF;">(</span><span style="color: #a7c0b9;">papiea</span>+<span style="color: #CC9393;">"/status"</span>, <span style="color: #F0DFAF; font-weight: bold;">func</span><span style="color: #D0BF8F;">(</span><span style="color: #7CB8BB;">req</span>, <span style="color: #7CB8BB;">res</span><span style="color: #D0BF8F;">)</span> <span style="color: #D0BF8F;">{</span>
        <span style="color: #a0d6e0;">res</span>.<span style="color: #93E0E3;">status</span><span style="color: #93E0E3;">(</span><span style="color: #93E0E3;">update_status_in_db</span><span style="color: #9FC59F;">(</span><span style="color: #a0d6e0;">req</span>.<span style="color: #c0afa7;">uuid</span>, <span style="color: #a0d6e0;">req</span>.<span style="color: #bba699;">status</span><span style="color: #9FC59F;">)</span> ? <span style="color: #c0a7bd;">200</span> : <span style="color: #a6bb99;">400</span><span style="color: #93E0E3;">)</span>
        <span style="color: #F0DFAF; font-weight: bold;">return</span> <span style="color: #a0d6e0;">res</span>;
    <span style="color: #D0BF8F;">}</span><span style="color: #BFEBBF;">)</span>
<span style="color: #DCDCCC;">}</span>


</pre>
</div>
</div>
</div>
<div id="outline-container-org7b02e40" class="outline-5">
<h5 id="org7b02e40"><span class="section-number-5">3.3.2.3</span> User facing APIs</h5>
<div class="outline-text-5" id="text-3-3-2-3">
<div class="org-src-container">
<pre class="src src-go" id="orgf921c6f"><span style="color: #F0DFAF; font-weight: bold;">func</span> <span style="color: #DCDCCC;">(</span><span style="color: #a7c0b9;">papiea</span> <span style="color: #7CB8BB;">papiea</span><span style="color: #DCDCCC;">)</span> <span style="color: #93E0E3;">user_facing_apis</span><span style="color: #DCDCCC;">()</span> <span style="color: #7CB8BB;">err</span> <span style="color: #DCDCCC;">{</span>
    <span style="color: #a7aac0;">registered_providers</span> = <span style="color: #a7c0b9;">papiea</span>.<span style="color: #b6a0e0;">providers_db</span>.<span style="color: #93E0E3;">list_providers</span><span style="color: #BFEBBF;">()</span>

    <span style="color: #F0DFAF; font-weight: bold;">for</span> <span style="color: #a0d6e0;">_</span>, <span style="color: #e0d0a0;">provider</span> := <span style="color: #F0DFAF; font-weight: bold;">range</span> <span style="color: #a7aac0;">registered_providers</span> <span style="color: #BFEBBF;">{</span>
        <span style="color: #F0DFAF; font-weight: bold;">for</span> <span style="color: #a0d6e0;">_</span>, <span style="color: #a7c0b9;">kind</span> := <span style="color: #F0DFAF; font-weight: bold;">range</span> <span style="color: #e0d0a0;">provider</span>.<span style="color: #7CB8BB;">kinds</span><span style="color: #D0BF8F;">{</span>

        <span style="color: #D0BF8F;">}</span>
    <span style="color: #BFEBBF;">}</span>
<span style="color: #DCDCCC;">}</span>
</pre>
</div>
</div>
</div>
</div>
