Papiea-design.org
*** SFS - Status Fields Signature
    When a spec change is submitted and successfully CAS'ed in, it is evaluated against the current
    status. The difference between this spec change and current status yields a Diff which is then
    evaluated using =Status Fields Signatures=. An SFS describes what changes in status needs to
    happen in order for the Diff to converge.

    This is a crucial element of the intent engine formalism, since it describes a way for the
    engine to "infer" which procedural actions are to be taken to complete an intentful
    specification.

    Here are a few examples of the proposed SFS syntax:
    1. =hosts.+{metadata.uuid}= - Matches when a new host entity (identified by =metadata.uuid=) has
       been added to the system. Typically this will the signature of a "create entity"
       function. 

    2. =hosts.-{metadata.uuid}= - Similar to the previous example, but this time the entity has been removed.
       
    3. =hosts.{metadata.uuid}.name= - Matches when an existing host is asking to rename. See the following example:
       #+BEGIN_EXAMPLE
         current host entity : {metadata {uuid "1234"
                                          kind "host"
                                          spec_version 3}
                                status   {name "a"
                                          network  [{mac "1.1.1.1.1"
                                                     cidr "10.0.0.0"
                                                     prefix_length 24}]}
                                spec     {name "a"
                                          network  [{mac "1.1.1.1.1"
                                                     cidr "10.0.0.0"
                                                     prefix_length 24}]}}

         new spec change: {metadata {uuid "1234"
                                          kind "host"
                                          spec_version 4}
                           spec     {name "new name"                    << DIFF
                                     network  [{mac "1.1.1.1.1"
                                                cidr "10.0.0.0"
                                                prefix_length 24}]}}
       #+END_EXAMPLE

       In this example, after successfully CASing the new spec, the entity would look like this:
       #+BEGIN_EXAMPLE
         current host entity : {metadata {uuid "1234"
                                          kind "host"
                                          spec_version 4}               << Updated
                                status   {name "a"
                                          network  [{mac "1.1.1.1.1"
                                                     cidr "10.0.0.0"
                                                     prefix_length 24}]}
                                spec     {name "new name"               << DIFF
                                          network  [{mac "1.1.1.1.1"
                                                     cidr "10.0.0.0"
                                                     prefix_length 24}]}}

       #+END_EXAMPLE

       We can see that the difference for the a particular host entity (as identified by the
       =metadata.uuid= value) is only in the =name= field. Thus, we want to find a function that
       knows how to transform the =name= status field. The engine will invoke the function that can
       resolve this diff.

    4. =hosts.{metadata.uuid}.networks.+{mac}= a handler that will get triggered when a new network
       is added to a vector found for key "networks", where the new network is identified by a field
       called "mac". Lets see this in the example, considering the =current host entity= as before:
       #+BEGIN_EXAMPLE
         new spec change: {metadata {uuid "1234"
                                     kind "host"
                                     spec_version 4}
                           spec     {name "a"
                                     network  [{mac "1.1.1.1.1"
                                                cidr "10.0.0.0"
                                                prefix_length 24}
                                               {mac "2.2.2.2.2"     << DIFF
                                                cidr "10.1.0.0"
                                                prefix_length 24}]}}
       #+END_EXAMPLE

       And we can see that once this new spec change will be CAS'ed in, there will be a diff only in
       the =network= key, and a new item (identifiable by =mac=) will be added. We need to invoke a
       function that knows how to add new networks to existing hosts.

    5. =hosts.{metadata.uuid}.networks.{mac}.cidr= Similar to the previous one, however, in here we
       are listening on a change of the =cidr= field inside an already existing network identifiable
       by =mac=. Now a function that changes cidr values for existing networks in existing hosts
       whould be invoked.
       
    6. =hosts.{metadata.uuid}.field_a, hosts.{metadata.uuid}.field_b= this is an example of a
       compound signature, which is matched when a single spec change has caused a difference in
       both =field_a= and =field_b= of a particular host, identified by =metadata.uuid=
       - We could revise the syntax to be something like =hosts.{metadata.uuid}.[field_a, field_b]= instead

    7. =hosts.{metadata.uuid}.field_a, hosts.{metadata.uuid}.inner.{id}.field_b= this is another
       example of a more complex signature, where a single spec change causes a difference in both
       =field_a= and =field_b= which is a compound object that lies inside a vector =inner= which is
       identified by =id=. Lets consider the following example:
       #+BEGIN_EXAMPLE
         current host entity : {metadata {uuid "1234"
                                          kind "host"
                                          spec_version 3}
                                status   {field_a "value 1"
                                          inner   [{id 1
                                                    field_b "value 2"}]}
                                spec     {field_a "value 1"
                                          inner   [{id 1
                                                    field_b "value 2"}]}}

         new spec change: {metadata {uuid "1234"
                                          kind "host"
                                          spec_version 4}
                            spec     {field_a "another val 1"               << DIFF
                                      inner   [{id 1
                                                field_b "another val 2"}]}} << DIFF

       #+END_EXAMPLE

       In this example, the SFS would match the spec change if it gets CAS'ed in properly. This
       syntax could also be revised to something like =hosts.{metadata.uuid}.[field_a, inner.{id}.field_b]=
       

**** Formal syntax of SFS
     The following is a formal syntax describing SFS:

     #+BEGIN_EXAMPLE
      S                = (Single-diff ',')* Single-diff
      Single-diff      = Same-path Terminal
      Terminal         = Different-field | Added-by-field | Removed-by-field
      Same-path        = ((Key '.') | Id-into-vector)+
      Id-into-vector   = '{' (Key '.')* Key '}' '.'
      Key              = #'[a-zA-Z_]+'
      Added-by-field   = '+' Id-field
      Removed-by-field = '-' Id-field
      Id-field         = '{' (Key '.')* Key '}'
      Different-field  = Key
    #+END_EXAMPLE
    
