Papiea-design.html
<div id="outline-container-orgeeeb724" class="outline-4">
<h4 id="orgeeeb724"><span class="section-number-4">3.3.3</span> Change Spec</h4>
</div>
<div id="outline-container-orge770d43" class="outline-4">
<h4 id="orge770d43"><span class="section-number-4">3.3.4</span> Update Status</h4>
</div>
<div id="outline-container-org0e59d1e" class="outline-4">
<h4 id="org0e59d1e"><span class="section-number-4">3.3.5</span> SFS - Status Fields Signature</h4>
<div class="outline-text-4" id="text-3-3-5">
<p>
When a spec change is submitted and successfully CAS'ed in, it is evaluated against the current
status. The difference between this spec change and current status yields a Diff which is then
evaluated using <code>Status Fields Signatures</code>. An SFS describes what changes in status needs to
happen in order for the Diff to converge.
</p>

<p>
This is a crucial element of the intent engine formalism, since it describes a way for the
engine to "infer" which procedural actions are to be taken to complete an intentful
specification.
</p>

<p>
Here are a few examples of the proposed SFS syntax:
</p>
<ol class="org-ol">
<li><code>hosts.+{metadata.uuid}</code> - Matches when a new host entity (identified by <code>metadata.uuid</code>) has
been added to the system. Typically this will the signature of a "create entity"
function.</li>

<li><code>hosts.-{metadata.uuid}</code> - Similar to the previous example, but this time the entity has been removed.</li>

<li><p>
<code>hosts.{metadata.uuid}.name</code> - Matches when an existing host is asking to rename. See the following example:
</p>
<pre class="example">
current host entity : {metadata {uuid "1234"
                                 kind "host"
                                 spec_version 3}
                       status   {name "a"
                                 network  [{mac "1.1.1.1.1"
                                            cidr "10.0.0.0"
                                            prefix_length 24}]}
                       spec     {name "a"
                                 network  [{mac "1.1.1.1.1"
                                            cidr "10.0.0.0"
                                            prefix_length 24}]}}

new spec change: {metadata {uuid "1234"
                                 kind "host"
                                 spec_version 4}
                  spec     {name "new name"                    &lt;&lt; DIFF
                            network  [{mac "1.1.1.1.1"
                                       cidr "10.0.0.0"
                                       prefix_length 24}]}}
</pre>

<p>
In this example, after successfully CASing the new spec, the entity would look like this:
</p>
<pre class="example">
current host entity : {metadata {uuid "1234"
                                 kind "host"
                                 spec_version 4}               &lt;&lt; Updated
                       status   {name "a"
                                 network  [{mac "1.1.1.1.1"
                                            cidr "10.0.0.0"
                                            prefix_length 24}]}
                       spec     {name "new name"               &lt;&lt; DIFF
                                 network  [{mac "1.1.1.1.1"
                                            cidr "10.0.0.0"
                                            prefix_length 24}]}}

</pre>

<p>
We can see that the difference for the a particular host entity (as identified by the
<code>metadata.uuid</code> value) is only in the <code>name</code> field. Thus, we want to find a function that
knows how to transform the <code>name</code> status field. The engine will invoke the function that can
resolve this diff.
</p></li>

<li><p>
<code>hosts.{metadata.uuid}.networks.+{mac}</code> a handler that will get triggered when a new network
is added to a vector found for key "networks", where the new network is identified by a field
called "mac". Lets see this in the example, considering the <code>current host entity</code> as before:
</p>
<pre class="example">
new spec change: {metadata {uuid "1234"
                            kind "host"
                            spec_version 4}
                  spec     {name "a"
                            network  [{mac "1.1.1.1.1"
                                       cidr "10.0.0.0"
                                       prefix_length 24}
                                      {mac "2.2.2.2.2"     &lt;&lt; DIFF
                                       cidr "10.1.0.0"
                                       prefix_length 24}]}}
</pre>

<p>
And we can see that once this new spec change will be CAS'ed in, there will be a diff only in
the <code>network</code> key, and a new item (identifiable by <code>mac</code>) will be added. We need to invoke a
function that knows how to add new networks to existing hosts.
</p></li>

<li><code>hosts.{metadata.uuid}.networks.{mac}.cidr</code> Similar to the previous one, however, in here we
are listening on a change of the <code>cidr</code> field inside an already existing network identifiable
by <code>mac</code>. Now a function that changes cidr values for existing networks in existing hosts
whould be invoked.</li>

<li><code>hosts.{metadata.uuid}.field_a, hosts.{metadata.uuid}.field_b</code> this is an example of a
compound signature, which is matched when a single spec change has caused a difference in
both <code>field_a</code> and <code>field_b</code> of a particular host, identified by <code>metadata.uuid</code>
<ul class="org-ul">
<li>We could revise the syntax to be something like <code>hosts.{metadata.uuid}.[field_a, field_b]</code> instead</li>
</ul></li>

<li><p>
<code>hosts.{metadata.uuid}.field_a, hosts.{metadata.uuid}.inner.{id}.field_b</code> this is another
example of a more complex signature, where a single spec change causes a difference in both
<code>field_a</code> and <code>field_b</code> which is a compound object that lies inside a vector <code>inner</code> which is
identified by <code>id</code>. Lets consider the following example:
</p>
<pre class="example">
current host entity : {metadata {uuid "1234"
                                 kind "host"
                                 spec_version 3}
                       status   {field_a "value 1"
                                 inner   [{id 1
                                           field_b "value 2"}]}
                       spec     {field_a "value 1"
                                 inner   [{id 1
                                           field_b "value 2"}]}}

new spec change: {metadata {uuid "1234"
                                 kind "host"
                                 spec_version 4}
                   spec     {field_a "another val 1"               &lt;&lt; DIFF
                             inner   [{id 1
                                       field_b "another val 2"}]}} &lt;&lt; DIFF

</pre>

<p>
In this example, the SFS would match the spec change if it gets CAS'ed in properly. This
syntax could also be revised to something like <code>hosts.{metadata.uuid}.[field_a, inner.{id}.field_b]</code>
</p></li>
</ol>
</div>


<div id="outline-container-org5845971" class="outline-5">
<h5 id="org5845971"><span class="section-number-5">3.3.5.1</span> Formal syntax of SFS</h5>
<div class="outline-text-5" id="text-3-3-5-1">
<p>
The following is a formal syntax describing SFS:
</p>

<pre class="example">
S                = (Single-diff ',')* Single-diff
Single-diff      = Same-path Terminal
Terminal         = Different-field | Added-by-field | Removed-by-field
Same-path        = ((Key '.') | Id-into-vector)+
Id-into-vector   = '{' (Key '.')* Key '}' '.'
Key              = #'[a-zA-Z_]+'
Added-by-field   = '+' Id-field
Removed-by-field = '-' Id-field
Id-field         = '{' (Key '.')* Key '}'
Different-field  = Key
</pre>
</div>
</div>
