Papiea-design.org
**** SFS struct
    #+Name: sfs-signature
    #+BEGIN_SRC go
      type sfs_signature struct {
          signature string
          parsed_signature_ast ...
      }
    #+END_SRC
*** Procedures Signatures
    Procedures are functions that providers can expose directly to an entity. These functions are
    not intentful by design, and usually cannot be expressed in terms of a spec change.

    For example, consider asking a host to reboot. The =Power= status of a host can either be =On=
    or =Off=. However, a reboot is not a state of a machine, its a transition of the power state,
    and thus cannot be expressed in terms of a desired state. It is said to be a =Procedure= that is
    exposed on the host kind.

    Similarly to SFS, procedures are also registring based on a signature, lets see an example:
    
    - =hosts/{metadata.uuid}/reboot= - This signature refers to a =host= kind, will look a particular
      host up by matching the given uuid to the =metadata.uuid= field of the host, and expose a
      function called =reboot=. Seeing this signature will cause the engine to add a the following new api end point for the
      host kind:
      #+BEGIN_EXAMPLE
      POST "/hosts/{uuid}/reboot" 
      #+END_EXAMPLE
  
      Where ={uuid}= value will be matched against the host's =metadata.uuid=. Once a POST request for this
      route has been received by the user, the request will be forwarded to the callback url provided at registration time.
    
**** Procedure Signature struct
     #+Name: procedure-signature
     #+BEGIN_SRC go
       type procedure_signature struct { signature string
           parsed_signature_ast ...  }
     #+END_SRC
*** Understanding Deltas
**** Matching SFSs to Deltas
**** Determining Order
*** Provider
    This section describes provider handling on Papiea's side. For the provider itself, please see [[*Provider Library][Provider Library]].
    
    As described in [[*Providers facing APIs][Providers facing APIs]] section, providers interact with the intetful engine by
    registring callbacks for two styles of actions:
    - Intentful actions - which are executed by analyzing their [[*SFS - Status Fields Signature][Status Fields Signature]]
    - Procedural actions - which are executed by a user interaction

    The following interface defines the registration mechanism for both kinds of actions:

    #+Name: provider-handler-interface
    #+BEGIN_SRC go
      type provider_callbacks interface {
          register_intentful_callback(sig sfs_signature, callback_url string) err
          register_procedural_callback(sig sfs_signature, callback_url string) err
      }
    #+END_SRC

    The following pseudocode describes how these may be implemented:

    #+Name: provider-handler-pc
    #+BEGIN_SRC go
      func (api_ctx papiea_api_ctx) register_intentful_callback(sf_sig sfs_signature, callback_url string) err {
          delta_analyzer.register(sf_sig, callback_url)
      }

      func (api_ctx papiea_api_ctx) register_procedural_callback(proc_sig proc_signature, callback_url string) err {
          procedures.register(proc_sig, callback_url)
      }
    #+END_SRC
*** RBAC
*** Scalability and Reliability
**** Leader election
**** Fault tolerance
***** Dead Papiea Instance
***** Dead Provider
*** Auditing
** Tasks
*** Tracking change
*** Finished
** Provider Library
*** Define Entity Model
**** YAML
**** CRUD
*** Initialize
*** Callback Mechanism
*** Running Effect Validator
*** Status Changes Handlers
**** Registring
**** Running using context
*** Procedures
**** Registring
**** Running using context
*** Example Provider

* Full files
