Papiea-design.html

<div id="outline-container-org64ec1b2" class="outline-5">
<h5 id="org64ec1b2"><span class="section-number-5">3.3.5.2</span> SFS struct</h5>
<div class="outline-text-5" id="text-3-3-5-2">
<div class="org-src-container">
<pre class="src src-go" id="org3458af0"><span style="color: #F0DFAF; font-weight: bold;">type</span> <span style="color: #7CB8BB;">sfs_signature</span> <span style="color: #F0DFAF; font-weight: bold;">struct</span> <span style="color: #DCDCCC;">{</span>
    <span style="color: #a6bb99;">signature</span> <span style="color: #c0afa7;">string</span>
    <span style="color: #a0d6e0;">parsed_signature_ast</span> ...
<span style="color: #DCDCCC;">}</span>
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-org569244c" class="outline-4">
<h4 id="org569244c"><span class="section-number-4">3.3.6</span> Procedures Signatures</h4>
<div class="outline-text-4" id="text-3-3-6">
<p>
Procedures are functions that providers can expose directly to an entity. These functions are
not intentful by design, and usually cannot be expressed in terms of a spec change.
</p>

<p>
For example, consider asking a host to reboot. The <code>Power</code> status of a host can either be <code>On</code>
or <code>Off</code>. However, a reboot is not a state of a machine, its a transition of the power state,
and thus cannot be expressed in terms of a desired state. It is said to be a <code>Procedure</code> that is
exposed on the host kind.
</p>

<p>
Similarly to SFS, procedures are also registring based on a signature, lets see an example:
</p>

<ul class="org-ul">
<li><p>
<code>hosts/{metadata.uuid}/reboot</code> - This signature refers to a <code>host</code> kind, will look a particular
host up by matching the given uuid to the <code>metadata.uuid</code> field of the host, and expose a
function called <code>reboot</code>. Seeing this signature will cause the engine to add a the following new api end point for the
host kind:
</p>
<pre class="example">
POST "/hosts/{uuid}/reboot" 
</pre>

<p>
Where <code>{uuid}</code> value will be matched against the host's <code>metadata.uuid</code>. Once a POST request for this
route has been received by the user, the request will be forwarded to the callback url provided at registration time.
</p></li>
</ul>
</div>

<div id="outline-container-org9b5bc31" class="outline-5">
<h5 id="org9b5bc31"><span class="section-number-5">3.3.6.1</span> Procedure Signature struct</h5>
<div class="outline-text-5" id="text-3-3-6-1">
<div class="org-src-container">
<pre class="src src-go" id="org46d6a82"><span style="color: #F0DFAF; font-weight: bold;">type</span> <span style="color: #7CB8BB;">procedure_signature</span> <span style="color: #F0DFAF; font-weight: bold;">struct</span> <span style="color: #DCDCCC;">{</span> <span style="color: #a6bb99;">signature</span> <span style="color: #c0afa7;">string</span>
    <span style="color: #a0d6e0;">parsed_signature_ast</span> ...  <span style="color: #DCDCCC;">}</span>
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-org4225fad" class="outline-4">
<h4 id="org4225fad"><span class="section-number-4">3.3.7</span> Understanding Deltas</h4>
<div class="outline-text-4" id="text-3-3-7">
</div>
<div id="outline-container-orgc25300d" class="outline-5">
<h5 id="orgc25300d"><span class="section-number-5">3.3.7.1</span> Matching SFSs to Deltas</h5>
</div>
<div id="outline-container-org4e6bfa0" class="outline-5">
<h5 id="org4e6bfa0"><span class="section-number-5">3.3.7.2</span> Determining Order</h5>
</div>
</div>
<div id="outline-container-org850945c" class="outline-4">
<h4 id="org850945c"><span class="section-number-4">3.3.8</span> Provider</h4>
<div class="outline-text-4" id="text-3-3-8">
<p>
This section describes provider handling on Papiea's side. For the provider itself, please see <a href="#orgea0fe58">Provider Library</a>.
</p>

<p>
As described in <a href="#org9ef395f">Providers facing APIs</a> section, providers interact with the intetful engine by
registring callbacks for two styles of actions:
</p>
<ul class="org-ul">
<li>Intentful actions - which are executed by analyzing their <a href="#org0e59d1e">Status Fields Signature</a></li>
<li>Procedural actions - which are executed by a user interaction</li>
</ul>

<p>
The following interface defines the registration mechanism for both kinds of actions:
</p>

<div class="org-src-container">
<pre class="src src-go" id="org187fc6f"><span style="color: #F0DFAF; font-weight: bold;">type</span> <span style="color: #7CB8BB;">provider_callbacks</span> <span style="color: #F0DFAF; font-weight: bold;">interface</span> <span style="color: #DCDCCC;">{</span>
    <span style="color: #93E0E3;">register_intentful_callback</span><span style="color: #BFEBBF;">(</span><span style="color: #bb99b4;">sig</span> <span style="color: #e0a0bc;">sfs_signature</span>, <span style="color: #b3c0a7;">callback_url</span> <span style="color: #c0afa7;">string</span><span style="color: #BFEBBF;">)</span> <span style="color: #e0a0bc;">err</span>
    <span style="color: #93E0E3;">register_procedural_callback</span><span style="color: #BFEBBF;">(</span><span style="color: #bb99b4;">sig</span> <span style="color: #e0a0bc;">sfs_signature</span>, <span style="color: #b3c0a7;">callback_url</span> <span style="color: #c0afa7;">string</span><span style="color: #BFEBBF;">)</span> <span style="color: #e0a0bc;">err</span>
<span style="color: #DCDCCC;">}</span>
</pre>
</div>

<p>
The following pseudocode describes how these may be implemented:
</p>

<div class="org-src-container">
<pre class="src src-go" id="org86479a6"><span style="color: #F0DFAF; font-weight: bold;">func</span> <span style="color: #DCDCCC;">(</span><span style="color: #a0d6e0;">api_ctx</span> <span style="color: #7CB8BB;">papiea_api_ctx</span><span style="color: #DCDCCC;">)</span> <span style="color: #93E0E3;">register_intentful_callback</span><span style="color: #DCDCCC;">(</span><span style="color: #a7aac0;">sf_sig</span> <span style="color: #7CB8BB;">sfs_signature</span>, <span style="color: #b3c0a7;">callback_url</span> <span style="color: #7CB8BB;">string</span><span style="color: #DCDCCC;">)</span> <span style="color: #7CB8BB;">err</span> <span style="color: #DCDCCC;">{</span>
    <span style="color: #a3e0a0;">delta_analyzer</span>.<span style="color: #93E0E3;">register</span><span style="color: #BFEBBF;">(</span><span style="color: #a7aac0;">sf_sig</span>, <span style="color: #b3c0a7;">callback_url</span><span style="color: #BFEBBF;">)</span>
<span style="color: #DCDCCC;">}</span>

<span style="color: #F0DFAF; font-weight: bold;">func</span> <span style="color: #DCDCCC;">(</span><span style="color: #a0d6e0;">api_ctx</span> <span style="color: #7CB8BB;">papiea_api_ctx</span><span style="color: #DCDCCC;">)</span> <span style="color: #93E0E3;">register_procedural_callback</span><span style="color: #DCDCCC;">(</span><span style="color: #a0d6e0;">proc_sig</span> <span style="color: #7CB8BB;">proc_signature</span>, <span style="color: #b3c0a7;">callback_url</span> <span style="color: #7CB8BB;">string</span><span style="color: #DCDCCC;">)</span> <span style="color: #7CB8BB;">err</span> <span style="color: #DCDCCC;">{</span>
    <span style="color: #a3e0a0;">procedures</span>.<span style="color: #93E0E3;">register</span><span style="color: #BFEBBF;">(</span><span style="color: #a0d6e0;">proc_sig</span>, <span style="color: #b3c0a7;">callback_url</span><span style="color: #BFEBBF;">)</span>
<span style="color: #DCDCCC;">}</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org32b306d" class="outline-4">
<h4 id="org32b306d"><span class="section-number-4">3.3.9</span> RBAC</h4>
</div>
<div id="outline-container-org98700af" class="outline-4">
<h4 id="org98700af"><span class="section-number-4">3.3.10</span> Scalability and Reliability</h4>
<div class="outline-text-4" id="text-3-3-10">
</div>
<div id="outline-container-org831b397" class="outline-5">
<h5 id="org831b397"><span class="section-number-5">3.3.10.1</span> Leader election</h5>
</div>
<div id="outline-container-org573c93f" class="outline-5">
<h5 id="org573c93f"><span class="section-number-5">3.3.10.2</span> Fault tolerance</h5>
<div class="outline-text-5" id="text-3-3-10-2">
</div>
<div id="outline-container-orgc86e9dd" class="outline-6">
<h6 id="orgc86e9dd"><span class="section-number-6">3.3.10.2.1</span> Dead Papiea Instance</h6>
</div>
<div id="outline-container-org3d415fe" class="outline-6">
<h6 id="org3d415fe"><span class="section-number-6">3.3.10.2.2</span> Dead Provider</h6>
</div>
</div>
</div>
<div id="outline-container-orgb6849b0" class="outline-4">
<h4 id="orgb6849b0"><span class="section-number-4">3.3.11</span> Auditing</h4>
</div>
</div>
<div id="outline-container-org84afd74" class="outline-3">
<h3 id="org84afd74"><span class="section-number-3">3.4</span> Tasks</h3>
<div class="outline-text-3" id="text-3-4">
</div>
<div id="outline-container-orge0a6f02" class="outline-4">
<h4 id="orge0a6f02"><span class="section-number-4">3.4.1</span> Tracking change</h4>
</div>
<div id="outline-container-org9846265" class="outline-4">
<h4 id="org9846265"><span class="section-number-4">3.4.2</span> Finished</h4>
</div>
</div>
<div id="outline-container-orgea0fe58" class="outline-3">
<h3 id="orgea0fe58"><span class="section-number-3">3.5</span> Provider Library</h3>
<div class="outline-text-3" id="text-3-5">
</div>
<div id="outline-container-org422083a" class="outline-4">
<h4 id="org422083a"><span class="section-number-4">3.5.1</span> Define Entity Model</h4>
<div class="outline-text-4" id="text-3-5-1">
</div>
<div id="outline-container-org46e338c" class="outline-5">
<h5 id="org46e338c"><span class="section-number-5">3.5.1.1</span> YAML</h5>
</div>
<div id="outline-container-org56997a4" class="outline-5">
<h5 id="org56997a4"><span class="section-number-5">3.5.1.2</span> CRUD</h5>
</div>
</div>
<div id="outline-container-org2a9af3d" class="outline-4">
<h4 id="org2a9af3d"><span class="section-number-4">3.5.2</span> Initialize</h4>
</div>
<div id="outline-container-orgd803330" class="outline-4">
<h4 id="orgd803330"><span class="section-number-4">3.5.3</span> Callback Mechanism</h4>
</div>
<div id="outline-container-org84e8783" class="outline-4">
<h4 id="org84e8783"><span class="section-number-4">3.5.4</span> Running Effect Validator</h4>
</div>
<div id="outline-container-org34402a5" class="outline-4">
<h4 id="org34402a5"><span class="section-number-4">3.5.5</span> Status Changes Handlers</h4>
<div class="outline-text-4" id="text-3-5-5">
</div>
<div id="outline-container-org5eb6a00" class="outline-5">
<h5 id="org5eb6a00"><span class="section-number-5">3.5.5.1</span> Registring</h5>
</div>
<div id="outline-container-org08c0f91" class="outline-5">
<h5 id="org08c0f91"><span class="section-number-5">3.5.5.2</span> Running using context</h5>
</div>
</div>
<div id="outline-container-org98e6176" class="outline-4">
<h4 id="org98e6176"><span class="section-number-4">3.5.6</span> Procedures</h4>
<div class="outline-text-4" id="text-3-5-6">
</div>
<div id="outline-container-org28789a4" class="outline-5">
<h5 id="org28789a4"><span class="section-number-5">3.5.6.1</span> Registring</h5>
</div>
<div id="outline-container-orgff0c51d" class="outline-5">
<h5 id="orgff0c51d"><span class="section-number-5">3.5.6.2</span> Running using context</h5>
</div>
</div>
<div id="outline-container-orgff6e8ed" class="outline-4">
<h4 id="orgff6e8ed"><span class="section-number-4">3.5.7</span> Example Provider</h4>
</div>
</div>
</div>
